import React from 'react'

import SwitchFilter from './Filters/SwitchFilter';
import Pagination from '../Pagination/Pagination';

import styles from './SearchHistory.module.scss';

const data = [
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
    {
        name: "Amazon - Список 1",
        count: 121,
        countOf: 1345,
        time: '12 минут назад'
    },
];


const SearchHistory = () => {
    return (
        <div className={styles.wrapper}>
            <h2 className={styles.title}>История поиска</h2>
            <div className={styles.top}>
                <div className={styles.left}>
                    <SwitchFilter name='Пользователи' childrenItems={['Все пользователи', 'Администратор', 'Пользователь 1']}/>
                    <svg width="10" height="12" viewBox="0 0 10 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.96323 0.135468C9.91504 0.05156 9.82682 0 9.73142 0H0.268571C0.173171 0 0.0849424 0.05156 0.0367589 0.135468C-0.0113978 0.219349 -0.0123109 0.323017 0.0344491 0.407746L4.22784 8.01044V11.7263C4.22784 11.8263 4.28139 11.9184 4.36747 11.9664C4.40773 11.9888 4.4521 12 4.49639 12C4.54683 12 4.59716 11.9855 4.64118 11.9568L5.64833 11.3001C5.72547 11.2498 5.77212 11.1629 5.77212 11.0695V8.01044L9.96556 0.407746C10.0123 0.323017 10.0114 0.219377 9.96323 0.135468ZM4.765 11.2263V8.21247H5.23499V10.9198L4.765 11.2263ZM5.34642 7.66512H4.65356L0.727604 0.547347H9.27236L5.34642 7.66512Z" fill="#227AFF"/>
                    </svg>
                </div>
                <SwitchFilter name='25' childrenItems={['50', '100', '250']}/>
            </div>
            <div className={styles.pagination}>
                <Pagination/>
            </div>
            <div className={styles.contentWrapper}>
                {data.map((item) => {
                    return <div className={styles.item}>
                        <div className={styles.left}>
                            <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M11.6693 3.5L5.2526 9.91667L2.33594 7" stroke="#227AFF" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                            <div className={styles.name}>{item.name}</div>
                        </div>
                        <div className={styles.right}>
                            <div className={styles.result}>Результаты <span>{item.count}</span> / <span>{item.countOf}</span></div>
                            <div className={styles.time}>{item.time}</div>
                            <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M16.4008 10.2C16.4798 10.1999 16.558 10.2154 16.631 10.2457C16.704 10.276 16.7702 10.3204 16.826 10.3765C16.8817 10.4325 16.9257 10.499 16.9556 10.5722C16.9855 10.6453 17.0006 10.7236 17 10.8027V13.5261C17.0006 13.6047 16.9856 13.6827 16.956 13.7556C16.9264 13.8284 16.8827 13.8948 16.8275 13.9507C16.7722 14.0067 16.7064 14.0512 16.634 14.0818C16.5615 14.1123 16.4837 14.1283 16.405 14.1287C16.3264 14.1283 16.2486 14.1123 16.1761 14.0818C16.1036 14.0512 16.0378 14.0067 15.9826 13.9507C15.9273 13.8948 15.8836 13.8284 15.854 13.7556C15.8244 13.6827 15.8095 13.6047 15.81 13.5261V12.5698C14.2622 15.1674 11.3892 17 8.29347 17C4.54497 17 1.40337 14.6872 0.0408151 11.1223C-0.0163947 10.9737 -0.0127904 10.8086 0.0508473 10.6627C0.114485 10.5169 0.233033 10.4019 0.380815 10.3428C0.686815 10.223 1.03192 10.3768 1.15092 10.687C2.34092 13.7998 5.05072 15.7956 8.29347 15.7956C11.1588 15.7956 13.8355 13.9409 15.0824 11.4146L13.8321 11.4232C13.7534 11.4233 13.6755 11.4079 13.6028 11.3778C13.5301 11.3478 13.464 11.3038 13.4084 11.2482C13.3527 11.1926 13.3086 11.1266 13.2784 11.0539C13.2483 10.9813 13.2328 10.9034 13.2328 10.8247C13.2308 10.666 13.2918 10.5129 13.4026 10.3991C13.5134 10.2853 13.6648 10.2201 13.8236 10.2179L16.4008 10.2ZM8.70827 0C12.4551 0 15.5975 2.31285 16.9601 5.87775C17.0173 6.02628 17.0137 6.19136 16.95 6.33725C16.8864 6.48314 16.7678 6.59809 16.6201 6.6572C16.5469 6.68571 16.4689 6.69942 16.3904 6.69751C16.312 6.69561 16.2347 6.67814 16.163 6.64611C16.0914 6.61408 16.0268 6.56813 15.9731 6.51094C15.9193 6.45375 15.8775 6.38645 15.85 6.31295C14.66 3.20025 11.9502 1.20445 8.70742 1.20445C5.84207 1.20445 3.16542 3.05915 1.91847 5.58535L3.16882 5.57685C3.24747 5.57674 3.32537 5.59213 3.39807 5.62216C3.47077 5.65218 3.53684 5.69624 3.5925 5.75182C3.64815 5.80739 3.69231 5.8734 3.72243 5.94606C3.75256 6.01871 3.76807 6.0966 3.76807 6.17525C3.77011 6.33404 3.70904 6.48715 3.59827 6.60094C3.48751 6.71474 3.3361 6.77991 3.17732 6.78215L0.599265 6.8C0.520252 6.80011 0.441998 6.78458 0.36902 6.75429C0.296042 6.724 0.229785 6.67956 0.174072 6.62353C0.118359 6.56751 0.0742943 6.501 0.0444201 6.42785C0.0145458 6.3547 -0.00054616 6.27636 1.50982e-05 6.19735V3.47395C1.50982e-05 3.14075 0.266065 2.8713 0.595015 2.8713C0.923115 2.8713 1.19002 3.14075 1.19002 3.47395V4.4302C2.73787 1.8326 5.61087 0 8.70657 0H8.70827Z" fill="#227AFF"/>
                            </svg>

                        </div>
                    </div>
                })}
            </div>
            <div className={styles.pagination}>
                <Pagination/>
            </div>
        </div>
      )
}

export default SearchHistory